chopra/errta.org
#+TITLE: 《结构动力学：理论及其在地震工程中的应用》勘误表
#+AUTHOR: 杨大伟
<<<<<<< HEAD
#+DATE: 2022年3月12日 -- 2022年3月31日
=======
#+DATE: 2022年3月12日
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153
#+OPTIONS: num:nil
#+OPTIONS: toc:nil
#+HTML_MATHJAX: align: left indent: 5em tagside: left font: Neo-Euler
#+HTML_MATHJAX: cancel.js noErrors.js
#+LaTeX_HEADER: \input{mypreamble}

* 勘误
<<<<<<< HEAD
** 献词
   
   - 陪我渡过漫漫的时光
   - 陪我度过漫漫的时光

** 第15页
=======
** 第14页
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153

   - 描述：图E1.3
   - 目标：两个桥墩
   - 修正：两个桥台
   - 依据：Chopra2012, page 17

<<<<<<< HEAD
=======
** 第15页

>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153
   - 描述：图E1.3
   - 目标：桥墩1，桥墩2
   - 修正：桥台1，桥台2
   - 依据：Chopra2012, page 18

** 第23页

   - 描述：E1.9式(1.10.2)转化为...
   - 目标：公式中角标$t = 1$ 
   - 修正：$\tau = t$

** 第57页

   - 描述：图3.2.5
   - 目标：纵轴缺少变量说明
   - 修正：$\ut / \usto$
   - 依据：Chopra2012, page 77, Figure 3.2.5 

** 第66页

   - 描述：倒第4行
   - 目标：$\omegann = 3 \alpha$
   - 修正：$\omegann = 3\propto$
   - 依据：Chopra2012, page 91

   - 描述：图3.5.1
   - 目标：纵轴标签$\uto/\ugo$
   - 修正：纵轴标签$\dduto/\ddugo$
   - 依据：Chopra2012, page 91

** 第75页

   - 描述：倒第10行
   - 目标：所作的必要折中
   - 修正：所做的必要折中

** 第85页

   - 描述：图E3.8 (e)
   - 目标：纵轴标签$\pt / \po$
   - 修正：$\ut / \usto$
   - 依据：Chopra2012, page 116, Figure E3.8 (e)

** 第91页

   - 描述：倒第5页
   - 目标：代入式(2.1.3)中
   - 修正：(2.2.4)中
   - 依据：Chopra2012, page 127

<<<<<<< HEAD
** 第164页

   - 描述：第3行
   - 目标：6.2.12节
   - 修正：6.12.2节

** 第166页

   - 描述：图6.8.2(b)
   - 目标：纵轴$u_{\mathrm{g}}$
   - 修正：$u$

=======
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153
** 第180页

   - 描述：节6.12该页第一句少个句号
   - 目标：函数图形
   - 修正：函数图形。

** 第199页

   - 描述：图7.3.1横轴标签
   - 目标：$\mu$
   - 修正：$u$

<<<<<<< HEAD
** 第205页

   - 描述：式7.5.2
   - 目标：$\dfrac{\Tn}{2\pi}$
   - 修正：$\dfrac{\Tn}{2\pi}\Ay$

** 第206页
   
   - 描述：图7.5.1
   - 目标：右侧轴标签：变性系数
   - 修正：折减系数 或 折减因子
   - 依据：Chopra2012, page 276

** 第207页

   - 描述：图7.5.2
   - 目标：纵轴标签$\Ay g$
   - 修正：纵轴标签$\Ay /g$

   - 描述：倒第5行
   - 目标：若个值
   - 修正：若干个值

=======
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153
** 第230页

   - 描述：第2行
   - 目标：第2段首行缩进4字
   - 修正：缩进2字

<<<<<<< HEAD
** 第265页
   
   - 描述：图9.1.4(d)
   - 目标：$\fS{1}$ 、$\fS{2}$
   - 修正：$\fI{1}$ 、$\fI{2}$
   - 依据：Chopra2012, page 276

=======
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153
** 第278页

   - 描述：E9.6矩阵中元素错误
   - 目标：柔度矩阵中$\alpha$
     $\hat{f}=\dfrac{L^{3}}{6EI}\begin{bmatrix}\alpha&3\\3&8\end{bmatrix}$
   - 修正：矩阵中的$\alpha$ 应为2
   - 依据：Chopra2012, page 368

<<<<<<< HEAD
** 第307页

   - 描述：倒第3行
   - 目标：$\vphin = (\vphi{1n}\ \vphi{2n})^{\mathrm{T}}$
   - 修正：$\vphin = (\phi_{1n}\ \phi_{2n})^{\mathrm{T}}$
   - 依据：Chopra2012, page 405

   - 描述：注1
   - 目标：文中
   - 修正：背景中/上下文中
   - 依据：Chopra2012, page 405

** 第315页

   - 描述：式(d)
   - 目标：$\phi_2$
   - 修正：$\vphi{2}$
   - 依据：Chopra2012, page 414

** 第316页

   - 描述：图E10.4(c)
   - 目标：顶层楼板质量块图元缺失
   - 修正：补上一个圆
   - 依据：Chopra2012, page 416

** 第317页 & 第318页

   - 描述：例题10.5 (e) (f)
   - 目标：0.387 1
   - 修正：0.3871
   - 依据：Chopra2012, page 417

** 第330页

   - 描述：表E10.14，其余表格亦有同样问题
   - 目标：所有向量数字0.003 9
   - 修正：0.0039
   - 依据：Chopra2012, page 433

** 第367页

   - 描述：12.8节第一句
   - 目标：其中各作用力$p_{j}(t)$ 随时间的变化是相同的，都为$p(t)$
   - 修正：其中各作用力$p_{j}(t)$ 都有相同的时间变化$p(t)$
   - 依据：Chopra2012, page 482

=======
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153
** 第391页

   - 位置：节13.1.4式(3.1.13)错误
   - 目标：将上式代入式(3.1.13)
   - 修正：将上式代入式(13.1.13)

** 第395页
   
   - 位置：节13.1.7式(13.1.18)符号错误
   - 目标：$p_{\mathrm{eff}}(t)$ 
   - 修正：$\bmit{p}_{\mathrm{eff}}(t)$ 
<<<<<<< HEAD
   
=======

>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153
** 第396页

   - 位置：图E13.2
   - 目标：$\vm_{1}$
   - 修正：$\vm \unity$
<<<<<<< HEAD

** 第398页

   - 位置：13.2.3节第2段第1句
   - 目标：虽然振型分析法在求解地震引起的结构内力时并不需要...
   - 修正：虽然楼层加速度在求解地震引起的结构内力计算中并不必要，但振
     型分析法可以给出其结果...
   - 依据：Chopra2012, page 524

** 第406页

   - 位置：图13.2.7 
   - 目标：$V_{\mathrm{b}}$
   - 修正：$V_{5}$
   - 依据：Chopra2012, page 535

** 第407页

   - 位置：图13.2.8 
   - 目标：乘法点太大
   - 修正：$\mathrm{klb{\cdot}ft}$
   - 依据：Chopra2012, page 536

* 排版
** 字体

   - 在本书排版中向量用粗体斜体字形，而原版是粗体正体字形。由于二级标
     题一般是加粗字体，当标量出现在二级标题中时，会以斜体粗体形式出现，
     此时会与向量混淆。如第367页12.8节标题，$\vpt=\vs p(t)$ 。
   - $\ddu$ 在本书排版中，两点的位置偏右

=======
* 排版
- 在本书排版中向量用粗体斜体字形，而原版是粗体正体字形。
- $\ddu$ 在本书排版中，两点的位置偏右
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153
** 第280页

   - 描述：倒第5-6行间距变大

