chopra/errta.tex
<<<<<<< HEAD
% Created 2022-04-01 Fri 17:31
=======
% Created 2022-03-16 Wed 21:58
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\input{mypreamble}
\author{杨大伟}
<<<<<<< HEAD
\date{2022年3月12日 -- 2022年3月31日}
=======
\date{2022年3月12日}
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153
\title{《结构动力学：理论及其在地震工程中的应用》勘误表}
\hypersetup{
 pdfauthor={杨大伟},
 pdftitle={《结构动力学：理论及其在地震工程中的应用》勘误表},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.3)}, 
 pdflang={English}}
\begin{document}

\maketitle

\section*{勘误}
<<<<<<< HEAD
\label{sec:orge79f780}
\subsection*{献词}
\label{sec:org4022648}

\begin{itemize}
\item 陪我渡过漫漫的时光
\item 陪我度过漫漫的时光
\end{itemize}

\subsection*{第15页}
\label{sec:org640736f}
=======
\label{sec:orgbed4ad6}
\subsection*{第14页}
\label{sec:orgc7ab7ea}
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153

\begin{itemize}
\item 描述：图E1.3
\item 目标：两个桥墩
\item 修正：两个桥台
\item 依据：Chopra2012, page 17
<<<<<<< HEAD

=======
\end{itemize}

\subsection*{第15页}
\label{sec:org00447dc}

\begin{itemize}
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153
\item 描述：图E1.3
\item 目标：桥墩1，桥墩2
\item 修正：桥台1，桥台2
\item 依据：Chopra2012, page 18
\end{itemize}

\subsection*{第23页}
<<<<<<< HEAD
\label{sec:org419ab45}
=======
\label{sec:orgde0ca5c}
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153

\begin{itemize}
\item 描述：E1.9式(1.10.2)转化为\ldots{}
\item 目标：公式中角标\(t = 1\)
\item 修正：\(\tau = t\)
\end{itemize}

\subsection*{第57页}
<<<<<<< HEAD
\label{sec:org523b2bc}
=======
\label{sec:org4ea04e1}
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153

\begin{itemize}
\item 描述：图3.2.5
\item 目标：纵轴缺少变量说明
\item 修正：\(\ut / \usto\)
\item 依据：Chopra2012, page 77, Figure 3.2.5
\end{itemize}

\subsection*{第66页}
<<<<<<< HEAD
\label{sec:org61e35ae}
=======
\label{sec:org7240393}
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153

\begin{itemize}
\item 描述：倒第4行
\item 目标：\(\omegann = 3 \alpha\)
\item 修正：\(\omegann = 3\propto\)
\item 依据：Chopra2012, page 91

\item 描述：图3.5.1
\item 目标：纵轴标签\(\uto/\ugo\)
\item 修正：纵轴标签\(\dduto/\ddugo\)
\item 依据：Chopra2012, page 91
\end{itemize}

\subsection*{第75页}
<<<<<<< HEAD
\label{sec:org2784890}
=======
\label{sec:org6841a34}
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153

\begin{itemize}
\item 描述：倒第10行
\item 目标：所作的必要折中
\item 修正：所做的必要折中
\end{itemize}

\subsection*{第85页}
<<<<<<< HEAD
\label{sec:org1bd92a7}
=======
\label{sec:org4f05035}
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153

\begin{itemize}
\item 描述：图E3.8 (e)
\item 目标：纵轴标签\(\pt / \po\)
\item 修正：\(\ut / \usto\)
\item 依据：Chopra2012, page 116, Figure E3.8 (e)
\end{itemize}

\subsection*{第91页}
<<<<<<< HEAD
\label{sec:org4cae8da}
=======
\label{sec:org3b211a0}
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153

\begin{itemize}
\item 描述：倒第5页
\item 目标：代入式(2.1.3)中
\item 修正：(2.2.4)中
\item 依据：Chopra2012, page 127
\end{itemize}

<<<<<<< HEAD
\subsection*{第164页}
\label{sec:org90347bc}

\begin{itemize}
\item 描述：第3行
\item 目标：6.2.12节
\item 修正：6.12.2节
\end{itemize}

\subsection*{第166页}
\label{sec:orge65ee9b}

\begin{itemize}
\item 描述：图6.8.2(b)
\item 目标：纵轴\(u_{\mathrm{g}}\)
\item 修正：\(u\)
\end{itemize}

\subsection*{第180页}
\label{sec:org7aff7b6}
=======
\subsection*{第180页}
\label{sec:org1616444}
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153

\begin{itemize}
\item 描述：节6.12该页第一句少个句号
\item 目标：函数图形
\item 修正：函数图形。
\end{itemize}

<<<<<<< HEAD
\subsection*{第199页}
\label{sec:orgf0887b0}

\begin{itemize}
\item 描述：图7.3.1横轴标签
\item 目标：\(\mu\)
\item 修正：\(u\)
\end{itemize}

\subsection*{第205页}
\label{sec:org70a970e}

\begin{itemize}
\item 描述：式7.5.2
\item 目标：\(\dfrac{\Tn}{2\pi}\)
\item 修正：\(\dfrac{\Tn}{2\pi}\Ay\)
\end{itemize}

\subsection*{第206页}
\label{sec:org3109cc3}

\begin{itemize}
\item 描述：图7.5.1
\item 目标：右侧轴标签：变性系数
\item 修正：折减系数 或 折减因子
\item 依据：Chopra2012, page 276
\end{itemize}

\subsection*{第207页}
\label{sec:org62d3dbd}

\begin{itemize}
\item 描述：图7.5.2
\item 目标：纵轴标签\(\Ay g\)
\item 修正：纵轴标签\(\Ay /g\)

\item 描述：倒第5行
\item 目标：若个值
\item 修正：若干个值
\end{itemize}

\subsection*{第230页}
\label{sec:orgd85c7a9}
=======
\subsection*{第230页}
\label{sec:org949a80f}
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153

\begin{itemize}
\item 描述：第2行
\item 目标：第2段首行缩进4字
\item 修正：缩进2字
\end{itemize}

<<<<<<< HEAD
\subsection*{第265页}
\label{sec:org6f07b3b}

\begin{itemize}
\item 描述：图9.1.4(d)
\item 目标：\(\fS{1}\) 、\(\fS{2}\)
\item 修正：\(\fI{1}\) 、\(\fI{2}\)
\item 依据：Chopra2012, page 276
\end{itemize}

\subsection*{第278页}
\label{sec:orgeff68db}
=======
\subsection*{第278页}
\label{sec:org56e2164}
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153

\begin{itemize}
\item 描述：E9.6矩阵中元素错误
\item 目标：柔度矩阵中\(\alpha\)
\(\hat{f}=\dfrac{L^{3}}{6EI}\begin{bmatrix}\alpha&3\\3&8\end{bmatrix}\)
\item 修正：矩阵中的\(\alpha\) 应为2
\item 依据：Chopra2012, page 368
\end{itemize}

<<<<<<< HEAD
\subsection*{第307页}
\label{sec:orga33fedf}

\begin{itemize}
\item 描述：倒第3行
\item 目标：\(\vphin = (\vphi{1n}\ \vphi{2n})^{\mathrm{T}}\)
\item 修正：\(\vphin = (\phi_{1n}\ \phi_{2n})^{\mathrm{T}}\)
\item 依据：Chopra2012, page 405

\item 描述：注1
\item 目标：文中
\item 修正：背景中/上下文中
\item 依据：Chopra2012, page 405
\end{itemize}

\subsection*{第315页}
\label{sec:org73f259a}

\begin{itemize}
\item 描述：式(d)
\item 目标：\(\phi_2\)
\item 修正：\(\vphi{2}\)
\item 依据：Chopra2012, page 414
\end{itemize}

\subsection*{第316页}
\label{sec:orgdcd8b2c}

\begin{itemize}
\item 描述：图E10.4(c)
\item 目标：顶层楼板质量块图元缺失
\item 修正：补上一个圆
\item 依据：Chopra2012, page 416
\end{itemize}

\subsection*{第317页 \& 第318页}
\label{sec:org58d23f9}

\begin{itemize}
\item 描述：例题10.5 (e) (f)
\item 目标：0.387 1
\item 修正：0.3871
\item 依据：Chopra2012, page 417
\end{itemize}

\subsection*{第330页}
\label{sec:org688013d}

\begin{itemize}
\item 描述：表E10.14，其余表格亦有同样问题
\item 目标：所有向量数字0.003 9
\item 修正：0.0039
\item 依据：Chopra2012, page 433
\end{itemize}

\subsection*{第367页}
\label{sec:org0d0e01d}

\begin{itemize}
\item 描述：12.8节第一句
\item 目标：其中各作用力\(p_{j}(t)\) 随时间的变化是相同的，都为\(p(t)\)
\item 修正：其中各作用力\(p_{j}(t)\) 都有相同的时间变化\(p(t)\)
\item 依据：Chopra2012, page 482
\end{itemize}

\subsection*{第391页}
\label{sec:org1e8c721}
=======
\subsection*{第391页}
\label{sec:orgb0c60da}
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153

\begin{itemize}
\item 位置：节13.1.4式(3.1.13)错误
\item 目标：将上式代入式(3.1.13)
\item 修正：将上式代入式(13.1.13)
\end{itemize}

\subsection*{第395页}
<<<<<<< HEAD
\label{sec:orgb2954d9}
=======
\label{sec:org11e0c0f}
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153

\begin{itemize}
\item 位置：节13.1.7式(13.1.18)符号错误
\item 目标：\(p_{\mathrm{eff}}(t)\)
\item 修正：\(\bmit{p}_{\mathrm{eff}}(t)\)
\end{itemize}

\subsection*{第396页}
<<<<<<< HEAD
\label{sec:org69ba1d6}
=======
\label{sec:org455935e}
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153

\begin{itemize}
\item 位置：图E13.2
\item 目标：\(\vm_{1}\)
\item 修正：\(\vm \unity\)
\end{itemize}
<<<<<<< HEAD

\subsection*{第398页}
\label{sec:org9bcfba9}

\begin{itemize}
\item 位置：13.2.3节第2段第1句
\item 目标：虽然振型分析法在求解地震引起的结构内力时并不需要\ldots{}
\item 修正：虽然楼层加速度在求解地震引起的结构内力计算中并不必要，但振
型分析法可以给出其结果\ldots{}
\item 依据：Chopra2012, page 524
\end{itemize}

\subsection*{第406页}
\label{sec:org1320e56}

\begin{itemize}
\item 位置：图13.2.7
\item 目标：\(V_{\mathrm{b}}\)
\item 修正：\(V_{5}\)
\item 依据：Chopra2012, page 535
\end{itemize}

\subsection*{第407页}
\label{sec:org19fceae}

\begin{itemize}
\item 位置：图13.2.8
\item 目标：乘法点太大
\item 修正：\(\mathrm{klb{\cdot}ft}\)
\item 依据：Chopra2012, page 536
\end{itemize}

\section*{排版}
\label{sec:org2a26369}
\subsection*{字体}
\label{sec:orgaca534c}

\begin{itemize}
\item 在本书排版中向量用粗体斜体字形，而原版是粗体正体字形。由于二级标
题一般是加粗字体，当标量出现在二级标题中时，会以斜体粗体形式出现，
此时会与向量混淆。如第367页12.8节标题，\(\vpt=\vs p(t)\) 。
\item \(\ddu\) 在本书排版中，两点的位置偏右
\end{itemize}

\subsection*{第280页}
\label{sec:org353be6c}
=======
\section*{排版}
\label{sec:orgfd52772}
\subsection*{在本书排版中向量用粗体斜体字形，而原版是粗体正体字形。}
\label{sec:org03a7f67}
\subsection*{\(\ddu\) 在本书排版中，两点的位置偏右}
\label{sec:org09ad263}
\subsection*{第280页}
\label{sec:org964f391}
>>>>>>> 66231eb9c0179497516b0c0aebca8d85a4d84153

\begin{itemize}
\item 描述：倒第5-6行间距变大
\end{itemize}
\end{document}